mahendrakumarshinde/MyRepo/4. Arduino setup files/STM32 arduino option and compiler flags/boards.txt
Dragonfly-L496RG.menu.speed.80=80 MHz
Dragonfly-L496RG.menu.speed.80.build.f_cpu=80000000L
Dragonfly-L496RG.menu.speed.72=72 MHz
Dragonfly-L496RG.menu.speed.72.build.f_cpu=72000000L
Dragonfly-L496RG.menu.speed.64=64 MHz
Dragonfly-L496RG.menu.speed.64.build.f_cpu=64000000L
Dragonfly-L496RG.menu.speed.48=48 MHz
Dragonfly-L496RG.menu.speed.48.build.f_cpu=48000000L
Dragonfly-L496RG.menu.speed.32=32 MHz
Dragonfly-L496RG.menu.speed.32.build.f_cpu=32000000L
Dragonfly-L496RG.menu.speed.24=24 MHz
Dragonfly-L496RG.menu.speed.24.build.f_cpu=24000000L
Dragonfly-L496RG.menu.speed.16=16 MHz
Dragonfly-L496RG.menu.speed.16.build.f_cpu=16000000L
Dragonfly-L496RG.menu.speed.8=8 MHz (No USB)
Dragonfly-L496RG.menu.speed.8.build.f_cpu=8000000L
Dragonfly-L496RG.menu.speed.4=4 MHz (No USB)
Dragonfly-L496RG.menu.speed.4.build.f_cpu=4000000L
Dragonfly-L496RG.menu.speed.2=2 MHz (No USB)
Dragonfly-L496RG.menu.speed.2.build.f_cpu=2000000L
Dragonfly-L496RG.menu.speed.1=1 MHz (No USB)
Dragonfly-L496RG.menu.speed.1.build.f_cpu=1000000L

Dragonfly-L496RG.menu.opt.os=Smallest Code
Dragonfly-L496RG.menu.opt.os.build.flags.optimize=-Os
Dragonfly-L496RG.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Dragonfly-L496RG.menu.opt.o1=Fast
Dragonfly-L496RG.menu.opt.o1.build.flags.optimize=-O1
Dragonfly-L496RG.menu.opt.o1.build.flags.ldspecs=
Dragonfly-L496RG.menu.opt.o2=Faster
Dragonfly-L496RG.menu.opt.o2.build.flags.optimize=-O2
Dragonfly-L496RG.menu.opt.o2.build.flags.ldspecs=
Dragonfly-L496RG.menu.opt.o3=Fastest
Dragonfly-L496RG.menu.opt.o3.build.flags.optimize=-O3
Dragonfly-L496RG.menu.opt.o3.build.flags.ldspecs=

# Tlera Butterfly
# ---------------------------------------
Butterfly-L433CC.name=Butterfly-L433CC
Butterfly-L433CC.vid.0=0x1209
Butterfly-L433CC.pid.0=0x6668

Butterfly-L433CC.upload.tool=stm32l4_dfu
Butterfly-L433CC.upload.protocol=dfu
Butterfly-L433CC.upload.maximum_size=245760
Butterfly-L433CC.upload.use_1200bps_touch=true
Butterfly-L433CC.upload.wait_for_upload_port=false
Butterfly-L433CC.upload.native_usb=false

Butterfly-L433CC.build.mcu=cortex-m4
Butterfly-L433CC.build.f_cpu=80000000L
Butterfly-L433CC.build.board=STM32L4_BUTTERFLY
Butterfly-L433CC.build.arch=STM32L4
Butterfly-L433CC.build.core=stm32l4
Butterfly-L433CC.build.vid=0x1209
Butterfly-L433CC.build.pid=0x6668
Butterfly-L433CC.build.did=0xffff
Butterfly-L433CC.build.usb_manufacturer="Tlera Corporation"
Butterfly-L433CC.build.usb_product="Butterfly"
Butterfly-L433CC.build.extra_flags=-DSTM32L433xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Butterfly-L433CC.build.ldscript=linker_scripts/STM32L433CC_FLASH.ld
Butterfly-L433CC.build.openocdscript=openocd_scripts/stm32l433cc_butterfly.cfg
Butterfly-L433CC.build.variant=STM32L433CC-Butterfly
Butterfly-L433CC.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l433 -larm_cortexM4lf_math
Butterfly-L433CC.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Butterfly-L433CC.menu.usb.cdc=Serial
Butterfly-L433CC.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Butterfly-L433CC.menu.usb.cdc_msc=Serial + Mass Storage
Butterfly-L433CC.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Butterfly-L433CC.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Butterfly-L433CC.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Butterfly-L433CC.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Butterfly-L433CC.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Butterfly-L433CC.menu.usb.cdc_dap=Serial + CMSIS-DAP
Butterfly-L433CC.menu.usb.cdc_dap.build.usb_type=USB_TYPE_CDC_DAP
Butterfly-L433CC.menu.usb.cdc_msc_dap=Serial + Mass Storage + CMSIS-DAP
Butterfly-L433CC.menu.usb.cdc_msc_dap.build.usb_type=USB_TYPE_CDC_MSC_DAP
Butterfly-L433CC.menu.usb.none=No USB
Butterfly-L433CC.menu.usb.none.build.usb_type=USB_TYPE_NONE

Butterfly-L433CC.menu.dosfs.none=None
Butterfly-L433CC.menu.dosfs.none.build.dosfs_sdcard=0
Butterfly-L433CC.menu.dosfs.none.build.dosfs_sflash=0
Butterfly-L433CC.menu.dosfs.sdspi=SDCARD (SPI)
Butterfly-L433CC.menu.dosfs.sdspi.build.dosfs_sdcard=1
Butterfly-L433CC.menu.dosfs.sdspi.build.dosfs_sflash=0

Butterfly-L433CC.menu.speed.80=80 MHz
Butterfly-L433CC.menu.speed.80.build.f_cpu=80000000L
Butterfly-L433CC.menu.speed.72=72 MHz
Butterfly-L433CC.menu.speed.72.build.f_cpu=72000000L
Butterfly-L433CC.menu.speed.64=64 MHz
Butterfly-L433CC.menu.speed.64.build.f_cpu=64000000L
Butterfly-L433CC.menu.speed.48=48 MHz
Butterfly-L433CC.menu.speed.48.build.f_cpu=48000000L
Butterfly-L433CC.menu.speed.32=32 MHz
Butterfly-L433CC.menu.speed.32.build.f_cpu=32000000L
Butterfly-L433CC.menu.speed.24=24 MHz
Butterfly-L433CC.menu.speed.24.build.f_cpu=24000000L
Butterfly-L433CC.menu.speed.16=16 MHz (No USB)
Butterfly-L433CC.menu.speed.16.build.f_cpu=16000000L
Butterfly-L433CC.menu.speed.8=8 MHz (No USB)
Butterfly-L433CC.menu.speed.8.build.f_cpu=8000000L
Butterfly-L433CC.menu.speed.4=4 MHz (No USB)
Butterfly-L433CC.menu.speed.4.build.f_cpu=4000000L
Butterfly-L433CC.menu.speed.2=2 MHz (No USB)
Butterfly-L433CC.menu.speed.2.build.f_cpu=2000000L
Butterfly-L433CC.menu.speed.1=1 MHz (No USB)
Butterfly-L433CC.menu.speed.1.build.f_cpu=1000000L

Butterfly-L433CC.menu.opt.os=Smallest Code
Butterfly-L433CC.menu.opt.os.build.flags.optimize=-Os
Butterfly-L433CC.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Butterfly-L433CC.menu.opt.o1=Fast
Butterfly-L433CC.menu.opt.o1.build.flags.optimize=-O1
Butterfly-L433CC.menu.opt.o1.build.flags.ldspecs=
Butterfly-L433CC.menu.opt.o2=Faster
Butterfly-L433CC.menu.opt.o2.build.flags.optimize=-O2
Butterfly-L433CC.menu.opt.o2.build.flags.ldspecs=
Butterfly-L433CC.menu.opt.o3=Fastest
Butterfly-L433CC.menu.opt.o3.build.flags.optimize=-O3
Butterfly-L433CC.menu.opt.o3.build.flags.ldspecs=

# Tlera Ladybug
# ---------------------------------------
Ladybug-L432KC.name=Ladybug-L432KC
Ladybug-L432KC.vid.0=0x1209
Ladybug-L432KC.pid.0=0x6669

